#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.bucket_suffix: Refreshing state... [id=5LB4FQ]
google_project_service.api["cloudbuild.googleapis.com"]: Refreshing state... [id=zapp-dev-app-search-6aa4/cloudbuild.googleapis.com]
google_project_service.api["cloudfunctions.googleapis.com"]: Refreshing state... [id=zapp-dev-app-search-6aa4/cloudfunctions.googleapis.com]
google_storage_bucket.bucket: Refreshing state... [id=function-source-e4b07815]
google_storage_bucket_object.archive: Refreshing state... [id=function-source-e4b07815-function-test-123-3d302e878bc3fda74269931c6e6264ca794597575e5457a79e43cae54b4a3a9f.zip]
google_cloudfunctions_function.function: Refreshing state... [id=projects/zapp-dev-app-search-6aa4/locations/europe-west2/functions/function-test-123]
google_pubsub_subscription.sub_push: Refreshing state... [id=projects/zapp-dev-infra-msg-0d5a/subscriptions/function-test-123-subscription]
google_cloudfunctions_function_iam_member.invoker: Refreshing state... [id=projects/zapp-dev-app-search-6aa4/locations/europe-west2/functions/function-test-123/roles/cloudfunctions.invoker/serviceAccount:pubsub@zapp-dev-infra-msg-0d5a.iam.gserviceaccount.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_pubsub_subscription.sub_push has been changed
  ~ resource "google_pubsub_subscription" "sub_push" {
        id                         = "projects/zapp-dev-infra-msg-0d5a/subscriptions/function-test-123-subscription"
        name                       = "function-test-123-subscription"
        # (8 unchanged attributes hidden)


      ~ push_config {
          + attributes    = {}
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }
        # (1 unchanged block hidden)
    }
  # google_storage_bucket.bucket has been changed
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "function-source-e4b07815"
      + labels                      = {}
        name                        = "function-source-e4b07815"
        # (10 unchanged attributes hidden)
    }
  # google_storage_bucket_object.archive has been changed
  ~ resource "google_storage_bucket_object" "archive" {
        id             = "function-source-e4b07815-function-test-123-3d302e878bc3fda74269931c6e6264ca794597575e5457a79e43cae54b4a3a9f.zip"
      + metadata       = {}
        name           = "function-test-123-3d302e878bc3fda74269931c6e6264ca794597575e5457a79e43cae54b4a3a9f.zip"
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.function will be updated in-place
  ~ resource "google_cloudfunctions_function" "function" {
        id                    = "projects/zapp-dev-app-search-6aa4/locations/europe-west2/functions/function-test-123"
        name                  = "function-test-123"
      ~ source_archive_object = "function-test-123-3d302e878bc3fda74269931c6e6264ca794597575e5457a79e43cae54b4a3a9f.zip" -> "function-test-123-543f93012ab46986a70e951cfd51fdaf6dea75f22ecab1e220f37c00211e1722.zip"
        # (14 unchanged attributes hidden)
    }

  # google_storage_bucket.bucket will be updated in-place
  ~ resource "google_storage_bucket" "bucket" {
        id                          = "function-source-e4b07815"
      ~ labels                      = {
          + "app" = "pubsub_event"
        }
        name                        = "function-source-e4b07815"
        # (10 unchanged attributes hidden)
    }

  # google_storage_bucket_object.archive must be replaced
-/+ resource "google_storage_bucket_object" "archive" {
      ~ content_type   = "application/zip" -> (known after apply)
      ~ crc32c         = "+F6K/A==" -> (known after apply)
      ~ detect_md5hash = "o9qMwoqh2OMoOsRm6CNLcA==" -> "different hash" # forces replacement
      ~ id             = "function-source-e4b07815-function-test-123-3d302e878bc3fda74269931c6e6264ca794597575e5457a79e43cae54b4a3a9f.zip" -> (known after apply)
      + kms_key_name   = (known after apply)
      ~ md5hash        = "o9qMwoqh2OMoOsRm6CNLcA==" -> (known after apply)
      ~ media_link     = "https://storage.googleapis.com/download/storage/v1/b/function-source-e4b07815/o/function-test-123-3d302e878bc3fda74269931c6e6264ca794597575e5457a79e43cae54b4a3a9f.zip?generation=1626391776766824&alt=media" -> (known after apply)
      - metadata       = {} -> null
      ~ name           = "function-test-123-3d302e878bc3fda74269931c6e6264ca794597575e5457a79e43cae54b4a3a9f.zip" -> "function-test-123-543f93012ab46986a70e951cfd51fdaf6dea75f22ecab1e220f37c00211e1722.zip" # forces replacement
      ~ output_name    = "function-test-123-3d302e878bc3fda74269931c6e6264ca794597575e5457a79e43cae54b4a3a9f.zip" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/function-source-e4b07815/o/function-test-123-3d302e878bc3fda74269931c6e6264ca794597575e5457a79e43cae54b4a3a9f.zip" -> (known after apply)
      ~ source         = "./deploy.zip" -> "./package.zip" # forces replacement
      ~ storage_class  = "STANDARD" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @guibirow, Action: `pull_request`, Working Directory: ``, Workflow: `ci/cd`*